Yu-Ting-Sun/yiki-m55m1/main.cpp
static bool SlideFilter_IsLocked(void)
{
    if (s_locked && (GetSystemTick_ms() - s_lockedAtMs) >= LOCK_HOLD_MS)
    {
        s_locked      = false;
        s_candHits    = 0;
        s_candUser[0] = '\0';
        s_lastSeenMs  = GetSystemTick_ms();   /* start the re-check window */
        printf("[LOCK] re-checking after %u ms — recognition back on\n",
               (unsigned)LOCK_HOLD_MS);
    }

    return s_locked;
}

/* Manual unlock (button). Unlike the timed re-check this also drops the
 * filter straight away: the viewer is telling the frame "not me". */
static void SlideFilter_Unlock(void)
{
    if (!s_locked)
        return;

    s_locked       = false;
    s_curUser[0]   = '\0';
    s_candUser[0]  = '\0';
    s_candHits     = 0;
    s_lastSeenMs   = GetSystemTick_ms();
    s_cooldown     = true;
    s_unlockedAtMs = s_lastSeenMs;
    Slideshow_SetFilter(NULL);
    printf("[LOCK] released by button -> playing all albums "
           "(ignoring faces for %u ms)\n", (unsigned)LOCK_UNLOCK_COOLDOWN_MS);
}

/* Called once per captured camera frame with the recognised label, or NULL
 * when nobody was recognised this frame (no face, unknown face, or recog
 * unavailable). Only called while unlocked. */
static void SlideFilter_Update(const char *label)
{
    if (s_cooldown)
    {
        if ((GetSystemTick_ms() - s_unlockedAtMs) < LOCK_UNLOCK_COOLDOWN_MS)
            return;

        s_cooldown = false;
    }

    if (label != NULL)
    {
        s_lastSeenMs = GetSystemTick_ms();

        if (strncmp(label, s_candUser, sizeof(s_candUser)) != 0)
        {
            strncpy(s_candUser, label, sizeof(s_candUser) - 1);
            s_candUser[sizeof(s_candUser) - 1] = '\0';
            s_candHits = 1;
        }
        else if (s_candHits < FILTER_SWITCH_HITS)
            s_candHits++;

        if (s_candHits >= FILTER_SWITCH_HITS)
        {
            if (strncmp(s_candUser, s_curUser, sizeof(s_curUser)) != 0)
            {
                strcpy(s_curUser, s_candUser);
                int n = Slideshow_SetFilter(s_curUser);
                printf("[FILTER] -> '%s' (%d album(s))\n", s_curUser, n);
            }

            s_locked     = true;
            s_lockedAtMs = GetSystemTick_ms();
            printf("[LOCK] holding '%s' for %u ms — recognition paused\n",
                   s_curUser, (unsigned)LOCK_HOLD_MS);
        }
    }
    else if (s_curUser[0] != '\0' &&
             (GetSystemTick_ms() - s_lastSeenMs) > FILTER_CLEAR_MS)
    {
        s_curUser[0]  = '\0';
        s_candUser[0] = '\0';
        s_candHits    = 0;
        Slideshow_SetFilter(NULL);
        printf("[FILTER] -> all (nobody recognised for %u ms)\n",
               (unsigned)FILTER_CLEAR_MS);
    }
}
#endif /* RUN_FACE_RECOG && !RUN_FACE_ENROLL */

/*----------------------------------------------------------------------------
 * main
 *--------------------------------------------------------------------------*/
int main(void)
{
    BoardInit();          /* clocks, UART, HyperRAM map, SD mount, NPU init */

#if RUN_ESP_PROBE
    /* Must run before PerfTimer_Init(): the probe owns SysTick for delays. */
    esp_probe_run();      /* never returns */
#endif

    /* NOTE: no DWT register is read here anymore - touching DWT/CoreSight
     * without a live debug session hangs this board (standalone-reset bug). */
    if (PerfTimer_Init())             /* timing source: DWT, else SysTick */
        printf("[OK] timing source: DWT CYCCNT (cycle-accurate)\n");
    else
        printf("[OK] timing source: SysTick 64-bit (DWT disabled - see PerfTimer.h)\n");

#if RUN_DAY2_TESTS
    day2_test_run();      /* Wi-Fi + HTTP link validation; never returns */
#endif

#if RUN_DAY3_DEMO
    /* Day-3 demo: story rail + photo slideshow side by side. */
    if (Display_Init() == 0)
    {
        int d3 = day3_demo_run();
        if (d3 != 0)
            printf_err("Day-3 story failed (rc=%d) - running photos only\n", d3);

        Slideshow_ReserveRight(STORYUI_RESERVED_PX);
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);

        int slrc;

        if (Slideshow_LibScan(SLIDESHOW_DIR) < 0)
            slrc = -1;
        else
        {
#if RUN_CAMERA_PREVIEW
            /* Preview sits in the bottom-right corner of the photo region.
             * No camera (init fail) degrades to the plain slideshow. */
            bool     camOk = (Camera_Init() == 0);
            uint32_t camX  = Disaplay_GetLCDWidth() - STORYUI_RESERVED_PX - CAM_W;
            uint32_t camY  = Disaplay_GetLCDHeight() - CAM_H;
#if RUN_FACE_DETECT
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
            /* Set once when the lock wipes the preview corner, so the wipe
             * happens on the lock edge and not on every idle tick. */
            bool previewCleared = false;
#if RUN_UNLOCK_BUTTON
            Button_Init();      /* manual unlock while locked */
#endif
#endif
            /* Face detection draws boxes onto the frame before it is blitted.
             * Init failure degrades to plain preview (no boxes). */
            bool fdOk = camOk && (FaceDetect_Init() == 0);
#if RUN_FACE_RECOG
            bool frOk = fdOk && (FaceRecog_Init() == 0);
#endif
#if RUN_FACE_ENROLL
            int  enrollSeen = 0;
#endif
            /* Single combined arena MPU setup (cacheable WTRA): the BSP
             * configures all app MPU regions in ONE InitPreDefMPURegion call,
             * so both arenas are set together here rather than per module. */
            if (fdOk)
            {
                ARM_MPU_Region_t rg[2];
                uint32_t nrg = 0;
                void    *aBase; uint32_t aSize;

                FaceDetect_GetArena(&aBase, &aSize);
                rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                nrg++;
#if RUN_FACE_RECOG
                if (frOk)
                {
                    FaceRecog_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
                }
#endif
                InitPreDefMPURegion(&rg[0], nrg);
            }

