Yu-Ting-Sun/yiki-m55m1/main.cpp
#if RUN_PHOTO_ENROLL && RUN_FACE_RECOG && !RUN_FACE_ENROLL
            /* Photo enrollment: scan 0:\faces for enroll_<label>.raw files,
             * run each through the identical detect/crop/embed pipeline as
             * if it were a camera frame, enroll, then rename it *.done.
             * (Names are collected first — renaming while f_readdir walks
             * the directory could disturb the iteration.) */
            if (fdOk && frOk)
            {
                static char names[PHOTO_ENROLL_MAX][40];
                int     nFound = 0;
                DIR     dj;
                FILINFO fno;

                if (f_opendir(&dj, "0:\\faces") == FR_OK)
                {
                    while (nFound < PHOTO_ENROLL_MAX &&
                           f_readdir(&dj, &fno) == FR_OK && fno.fname[0])
                    {
                        size_t n = strlen(fno.fname);
                        if (n >= sizeof(names[0]) ||
                            n < 12 ||                       /* enroll_x.raw */
                            strncmp(fno.fname, "enroll_", 7) != 0 ||
                            strcmp(&fno.fname[n - 4], ".raw") != 0)
                            continue;
                        strcpy(names[nFound++], fno.fname);
                    }
                    f_closedir(&dj);
                }

                for (int pi = 0; pi < nFound; pi++)
                {
                    char   label[24], rawPath[56], donePath[56];
                    size_t ll = strlen(names[pi]) - 7 - 4;
                    if (ll >= sizeof(label)) continue;
                    memcpy(label, &names[pi][7], ll);
                    label[ll] = '\0';

                    /* enroll_user1-2.raw -> user1 (extra reference photos) */
                    char *dash = strrchr(label, '-');
                    if (dash && dash[1])
                    {
                        bool digits = true;
                        for (char *p = dash + 1; *p; p++)
                            if (*p < '0' || *p > '9') digits = false;
                        if (digits) *dash = '\0';
                    }

                    snprintf(rawPath,  sizeof(rawPath),  "0:\\faces\\%s", names[pi]);
                    snprintf(donePath, sizeof(donePath), "0:\\faces\\%s", names[pi]);
                    memcpy(&donePath[strlen(donePath) - 4], ".done", 6);

                    FIL pf;
                    if (f_open(&pf, rawPath, FA_READ) != FR_OK)
                        continue;

                    uint16_t *frame = (uint16_t *)Camera_GetFrame();
                    UINT      br    = 0;
                    FRESULT   fr2   = f_read(&pf, frame, CAM_W * CAM_H * 2, &br);
                    f_close(&pf);

                    if (fr2 == FR_OK && br == CAM_W * CAM_H * 2)
                    {
                        FaceBox tb;
                        if (FaceDetect_Run(frame, CAM_W, CAM_H) > 0 &&
                            FaceDetect_GetTopBox(&tb))
                        {
                            if (FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb,
                                                 label) == 0)
                            {
                                f_unlink(donePath);
                                f_rename(rawPath, donePath);
                                printf("[PHOTO-ENROLL] '%s' enrolled from %s\n",
                                       label, rawPath);
                            }
                        }
                        else
                            printf("[PHOTO-ENROLL] no face detected in %s\n",
                                   rawPath);

                        Camera_Blit(camX, camY);   /* show photo + box briefly */
                    }
                    else
                        printf("[PHOTO-ENROLL] bad size in %s: read %u, want %u\n",
                               rawPath, (unsigned)br, (unsigned)(CAM_W * CAM_H * 2));
                }
            }
#endif
#endif
#endif

            for (;;)
            {
                slrc = Slideshow_ShowNext();
                if (slrc != 0) break;

                /* Hold window: this idle time is where the camera (and later
                 * the face-recognition inference) runs. */
                uint32_t t0 = GetSystemTick_ms();

                while ((GetSystemTick_ms() - t0) < SLIDESHOW_HOLD_MS)
                {
#if RUN_CAMERA_PREVIEW
#if RUN_FACE_DETECT && RUN_FACE_RECOG && !RUN_FACE_ENROLL
                    /* Locked on a viewer: no capture, no inference, and the
                     * corner preview is wiped once so the frame stays clean.
                     * Only the unlock button is polled. */
                    if (SlideFilter_IsLocked())
                    {
#if RUN_UNLOCK_BUTTON
                        if (Button_Pressed())
                            SlideFilter_Unlock();
#endif
                        if (!previewCleared)
                        {
                            S_DISP_RECT r = { camX, camY,
                                              camX + CAM_W - 1, camY + CAM_H - 1 };
                            Display_ClearRect(C_BLACK, &r);
                            previewCleared = true;
                        }

                        Display_Delay(50);
                        continue;
                    }

                    previewCleared = false;
#endif
                    if (camOk)
                    {
                        if (Camera_Capture() != 0)
                        {
                            camOk = false;      /* capture died: stop trying */
                            continue;
                        }

                        uint16_t *frame = (uint16_t *)Camera_GetFrame();

#if RUN_FACE_DETECT
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        const char *seenUser = NULL;
#endif
                        if (fdOk && FaceDetect_Run(frame, CAM_W, CAM_H) > 0)
                        {
                            FaceBox tb;
                            if (FaceDetect_GetTopBox(&tb))
                            {
#if RUN_FACE_RECOG
#if RUN_FACE_ENROLL
                                if (frOk && enrollSeen < ENROLL_SAMPLES)
                                {
                                    FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb, ENROLL_LABEL);
                                    if (++enrollSeen >= ENROLL_SAMPLES)
                                        printf("[ENROLL] captured %d samples — done\n", ENROLL_SAMPLES);
                                }
#else
                                if (frOk && FaceRecog_Run(frame, CAM_W, CAM_H, &tb) == 1)
                                    seenUser = FaceRecog_GetLabel();
#endif
#endif
                            }
                        }
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        SlideFilter_Update(seenUser);
#endif
#endif
                        Camera_Blit(camX, camY);
                        continue;
                    }
#endif
                    Display_Delay(50);
                }
            }
        }

        printf_err("Slideshow could not run (rc=%d) - keeping story screen\n", slrc);
        for (;;) __WFI();     /* keep whatever is on screen; demo is over */
    }
    printf_err("Display_Init failed (check LCD panel define in board_config.h)\n");
#endif

#if RUN_SLIDESHOW && !RUN_DAY3_DEMO
    /* Photo-frame milestone: cycle SD-card photos on the LCD. Never returns
     * while it has photos to show; on failure fall through to the tests. */
    if (Display_Init() == 0)
    {
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);
        int slrc = Slideshow_Run(SLIDESHOW_DIR, SLIDESHOW_HOLD_MS);
        printf_err("Slideshow could not run (rc=%d) - continuing with tests\n", slrc);
    }
    else
    {
        printf_err("Display_Init failed (check LCD panel define in board_config.h) - continuing with tests\n");
    }
#endif

#if RUN_DAY1_TESTS
    printf("\n");
    printf("==============================================\n");
    printf(" M55M1 Dual-Model PoC - Day 1 Validation\n");
    printf("==============================================\n");
    printf(" HyperRAM   : FACE @0x%08X  GESTURE @0x%08X  slot=%u KB\n",
           (unsigned)FACE_MODEL_ADDR, (unsigned)GESTURE_MODEL_ADDR,
           (unsigned)(MODEL_SLOT_SIZE / 1024));
    printf(" arenas     : FACE %u KB @0x%08X | GESTURE %u KB @0x%08X (resident)\n",
           (unsigned)(FACE_ARENA_SZ / 1024),    (unsigned)(uintptr_t)FACE_ARENA_PTR,
           (unsigned)(GESTURE_ARENA_SZ / 1024), (unsigned)(uintptr_t)GESTURE_ARENA_PTR);

