Yu-Ting-Sun/yiki-m55m1/main.cpp
    bool t1 = test_load_both_models();

    setup_arena_mpu();    /* after load, before inference */

    /* Build both interpreters exactly once; they stay resident from here on. */
    printf("\n=== Interpreter Init (once per model) ===\n");
    init_model_once(faceModel,    MODEL_FACE,    FACE_ARENA_PTR,    FACE_ARENA_SZ,    "FACE");
    init_model_once(gestureModel, MODEL_GESTURE, GESTURE_ARENA_PTR, GESTURE_ARENA_SZ, "GESTURE");

    bool t2 = run_inference_bench(faceModel,    MODEL_FACE,    "FACE");
    bool t3 = run_inference_bench(gestureModel, MODEL_GESTURE, "GESTURE");
    bool t4 = test_alternating();

    /* ---- Summary mapped to the Day-1 success criteria ---- */
    printf("\n==============================================\n");
    printf(" Day-1 Summary\n");
    printf("==============================================\n");
    printf(" [%s] Both models load to non-overlapping addrs + CRC OK\n", t1 ? "PASS" : "FAIL");
    printf(" [%s] Face inference < 100 ms + output valid\n",            t2 ? "PASS" : "FAIL");
    printf(" [%s] Gesture inference < 100 ms + output valid\n",         t3 ? "PASS" : "FAIL");
    printf(" [%s] %d alternating switches, no crash, output valid\n",   t4 ? "PASS" : "FAIL", ALT_SWITCHES);
    printf(" Overall: %s\n", (t1 && t2 && t3 && t4) ? "DAY-1 PASS" : "NEEDS REVIEW");
    printf("==============================================\n");
    printf("=== All Tests Done ===\n");
#else
    printf("\n(Day-1 validation compiled out - RUN_DAY1_TESTS=1 to re-run; results in final_report.md)\n");
#endif /* RUN_DAY1_TESTS */

    while (1) { __WFI(); }
}
